Revit 2024 API
BuiltInFailures.DimensionFailures.DimensionPerpendicularToView Property
 The Dimension is perpendicular to the current view, and no longer valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DimensionPerpendicularToView { get; }
Visual Basic
Public Shared ReadOnly Property DimensionPerpendicularToView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DimensionPerpendicularToView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace